import random

def get_random():
    FAMOUS_PEOPLE = {'Ленин Владимир Ильич': '22.04.1870',
    'Шукшин Василий Макарович': '25.07.1929',
     'Высоцкий Владимир Семенович' : '25.01.1938',
     'Куприн Александр Иванович'   : '26.08.1870',
    'Петр 1 Алексеевич (Великий)'  : '09.06.1672',
    'Чехов  Антон Павлович '       : '29.01.1860',
    'Толстой Лев Николаевич'       : '09.09.1828',
     'Есенин  Сергей Александрович' : '03.10.1895',
     'Пушкин  Александр Сергеевич'  : '06.06.1799',
    'Гоголь Николай Васильевич'     : '01.04.1809',}

    list_famous_keys = []
    for key in FAMOUS_PEOPLE :
        list_famous_keys.append(key)



    sampling = random.choices(list_famous_keys, k=5)

    for i in sampling:
        data_per = input("Когда родился" + i + " : ")
        if  data_per == FAMOUS_PEOPLE.get(i):
            print ("Верно!")
        else:
            print ("Неверно! ")
